In [16]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression 

df =pd.read_csv('train.csv')
df

       area   price
0      8450  208500
1      9600  181500
2     11250  223500
3      9550  140000
4     14260  250000
...     ...     ...
1455   7917  175000
1456  13175  210000
1457   9042  266500
1458   9717  142125
1459   9937  147500

[1460 rows x 2 columns]

In [17]:
reg = LinearRegression()
reg.fit(df[['area']], df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [18]:
reg.coef_

array([2.09997195])

In [22]:
reg.intercept_

158836.1518968766

In [23]:
"example 2"

'example 2'

In [26]:
df =pd.read_csv('train_2.csv')
df

       area  year   price
0      8450  2003  208500
1      9600  1976  181500
2     11250  2001  223500
3      9550  1915  140000
4     14260  2000  250000
...     ...   ...     ...
1455   7917  1999  175000
1456  13175  1978  210000
1457   9042  1941  266500
1458   9717  1950  142125
1459   9937  1965  147500

[1460 rows x 3 columns]

In [27]:
reg = LinearRegression()
reg.fit(df[['area', 'year']], df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [28]:
reg.coef_

array([   2.04117215, 1365.77615312])

In [29]:
reg.intercept_

-2532856.0245703217